// destructuring არის javascript-ის სინტაქსი, რომელიც საშუალებას გვაძლევს
// "გავშალოთ" მასივები ან ობიექტები და მათი მნიშვნელობები მივანიჭოთ ცვლადებს
// destructuring შემოტანილი იქნა ES6-ში
// destructuring ამარტივებს მონაცემების ამოღებას მასივებიდან და ობიექტებიდან
// მასივის destructuring გამოიყენება მასივის ელემენტების ცვლადებში შესანახად
// ობიექტის destructuring გამოიყენება ობიექტის თვისებების ცვლადებში შესანახად
// შესაძლებელია ცვლადების სახელების შეცვლა destructuring-ის დროს
// შესაძლებელია ჩაშენებული ობიექტების destructuring
