"use strict";

// // ეს არის გლობალური strict mode რომელიც გლობალურად ანუ ყველა კოდის ნაწილზე აქვს წვდომა

console.log("global strict: ")

x = 10;
console.log(x);

// // ეს კოდი აგდებს ერორს "ReferenceError: x is not defined" რადგან როდესაც ვიყენებთ strict mode -ს ჩვენ არ შეგვიძლია ისეთი ცვლადების შექმნა ან გამოყენება რომელიც გამოცხადებულია მისი ტიპის გარეშე.


console.log("               ");

console.log("local strict: ")

// ეს არის ლოკალური strict mode რომელიც მხოლოდ იმ მითითებულ კოდის ბლოკზე (ამ შემთხვევაში ფუნქციაზე) აქვს წვდომა და strict mode დადებული 

function sum(a, b, c) {
   
    return a + a + c;
}

console.log(sum(1, 2, 3));

// ეს კოდი აგდებს ერორს რადგან როდესაც ვიყენებთ strict mode -ს ჩვენ არ შეგვიძლია ესეთი პრობლემ დავუშვათ სადაც ვიყენებთ იგივე პარამეტრს და ვამატებთ ერთმანეთზე


